<template>
  <h2>つかいかた</h2>
  <ol>
    <li>左の数字入力欄から<strong>拡大率(100～400%)</strong>を設定する</li>
    <li>ピクチャを選択ボタンをクリックして<strong>ピクチャを選ぶ</strong></li>
    <li><strong>変換ボタン</strong>をクリックする</li>
    <li>イラスト調で拡大されたピクチャが出てくる</li>
    <li>出てきたピクチャかZIPダウンロードボタンをクリックしてピクチャを保存</li>
    <li>幸せ！</li>
  </ol>
  <p>※変換元ピクチャの縦横サイズが大きすぎたら変換後ピクチャの一部が途切れます（現在原因究明中…）</p>

  <h2 class="margin-t-2">Tips</h2>
  <ul>
    <li>解像度の低いイラスト(ドット絵ではない)はキレイに拡大されません</li>
    <li>拡大率を100%に指定することでドット絵にアンチエイリアスをかけることができます</li>
  </ul>
</template>
